БСП_2_4_5/src/DataProcessors/_ДемоЗагрузкаЮридическихЛицКонтрагентов/_ДемоЗагрузкаЮридическихЛицКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>_ДемоЗагрузкаЮридическихЛицКонтрагентов</name>
  <comment>Для обновления следует поднять номер версии в функции СведенияОВнешнейОбработке и запустить обновление ИБ.</comment>
</mdclass:DataProcessor>

БСП_2_4_5/src/Enums/_ДемоЮридическоеФизическоеЛицо/_ДемоЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ДемоЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

БСП_2_4_5/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

БСП_2_4_5/src/Catalogs/_ДемоКонтрагенты/_ДемоКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ДемоКонтрагенты</name>
  <comment>Контрагент</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef._ДемоПартнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef._ДемоЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <type>
      <types>CatalogRef._ДемоДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИностранныйКонтрагент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <comment>Тип</comment>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <comment>Вид</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БСП_2_4_5/src/DataProcessors/_ДемоЗагрузкаЮридическихЛицКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.3.1");
	ПараметрыРегистрации.Информация = НСтр("ru = 'Загрузка юридических лиц (с контактной информацией) в справочник ""Демо: Контрагенты"".'");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "2.4.1.1";
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Демо: Контрагенты (Юридические лица с контактной информацией)'");
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыЗагрузкаДанныхИзФайла();
	Команда.Модификатор   = Метаданные.Справочники._ДемоКонтрагенты.ПолноеИмя();
	Команда.Идентификатор = "ЮрЛицаКонтрагентов";
	
	Возврат ПараметрыРегистрации;
КонецФункции

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#КонецОбласти

// Определяет параметры загрузки данных из файла.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, определенное в функции СведенияОВнешнейОбработке().
//   ПараметрыЗагрузки - Структура - Настройки загрузки данных:
//       * ИмяМакетаСШаблоном - Строка - Имя макета с шаблоном загружаемых данных.
//           По умолчанию используется макет "ЗагрузкаИзФайла".
//       * ОбязательныеКолонкиМакета - Массив - Список имен колонок обязательных для заполнения.
//
Процедура ОпределитьПараметрыЗагрузкиДанныхИзФайла(ИдентификаторКоманды, ПараметрыЗагрузки) Экспорт
	Если ИдентификаторКоманды = "ЮрЛицаКонтрагентов" Тогда
		ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаИзФайлаКонтрагенты";
	КонецЕсли;
КонецПроцедуры

// Сопоставляет загружаемые данные с данными в информационной базе.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, определенное в функции СведенияОВнешнейОбработке().
//   ЗагружаемыеДанные - ТаблицаЗначений - Описание загружаемых данных:
//       * СопоставленныйОбъект - СправочникСсылка.Ссылка - Ссылка на сопоставленный объект.
//           Заполняется внутри этой процедуры.
//       * <другие колонки> - Строка - Данные, загруженные из файла.
//           Состав колонок соответствует макету "ЗагрузкаИзФайла".
//
Процедура СопоставитьЗагружаемыеДанныеИзФайла(ИдентификаторКоманды, ЗагружаемыеДанные) Экспорт
	
	Если ИдентификаторКоманды = "ЮрЛицаКонтрагентов" Тогда
		СопоставитьКонтрагентов(ЗагружаемыеДанные);
	КонецЕсли;
	
КонецПроцедуры

// Загружает сопоставленные данные в базу.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, определенное в функции СведенияОВнешнейОбработке().
//   ЗагружаемыеДанные - ТаблицаЗначений - Описание загружаемых данных:
//       * СопоставленныйОбъект - СправочникСсылка - Ссылка на сопоставленный объект.
//       * РезультатСопоставленияСтроки - Строка - Статус загрузки. Возможны варианты: Создан, Обновлен, Пропущен.
//       * ОписаниеОшибки   - Строка - Расшифровка ошибки загрузки данных.
//       * Идентификатор    - Число  - Уникальный номер строки.
//       * <другие колонки> - Строка - Данные, загруженные из файла.
//           Состав колонок соответствует макету "ЗагрузкаИзФайла".
//   ПараметрыЗагрузки - Структура - Параметры с пользовательскими установками загрузки данных.
//       * СоздаватьНовые        - Булево - Требуется ли создавать новые элементы справочника.
//       * ОбновлятьСуществующие - Булево - Требуется ли обновлять элементы справочника.
//   Отказ - Булево - Признак отмены загрузки.
//
Процедура ЗагрузитьИзФайла(ИдентификаторКоманды, ЗагружаемыеДанные, ПараметрыЗагрузки, Отказ) Экспорт
	Если ИдентификаторКоманды = "ЮрЛицаКонтрагентов" Тогда
		ЗаписьКонтрагентовИзФайла(ЗагружаемыеДанные, ПараметрыЗагрузки, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СопоставитьКонтрагентов(ЗагружаемыеДанные)
	
	Для Каждого Строка Из ЗагружаемыеДанные Цикл
		Строка.ОбъектСопоставления = Справочники._ДемоКонтрагенты.НайтиПоРеквизиту("ИНН", СокрЛП(Строка.ИНН));
		Если Строка.ОбъектСопоставления = Неопределено Тогда
			Строка.ОбъектСопоставления = Справочники._ДемоКонтрагенты.НайтиПоНаименованию(Строка.Наименование, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьКонтрагентовИзФайла(ЗагружаемыеДанные, ПараметрыЗагрузки, Отказ)
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектСопоставления) Тогда
			Если Не ПараметрыЗагрузки.ОбновлятьСуществующие Тогда
				СтрокаТаблицы.РезультатСопоставленияСтроки = "Пропущен";
				Продолжить;
			КонецЕсли;
		Иначе
			Если Не ПараметрыЗагрузки.СоздаватьНовые Тогда
				СтрокаТаблицы.РезультатСопоставленияСтроки = "Пропущен";
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			ЗаписатьКонтрагента(СтрокаТаблицы);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			СтрокаТаблицы.РезультатСопоставленияСтроки = "Пропущен";
			СтрокаТаблицы.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьКонтрагента(СтрокаТаблицы)
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОбъектСопоставления) Тогда
		ЭлементСправочника = Справочники._ДемоКонтрагенты.СоздатьЭлемент();
		СтрокаТаблицы.ОбъектСопоставления = ЭлементСправочника;
		СтрокаТаблицы.РезультатСопоставленияСтроки = "Создан";
	Иначе
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник._ДемоКонтрагенты");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.ОбъектСопоставления);
		ИнформацияОбОшибке = Неопределено;
		Попытка
			Блокировка.Заблокировать();
		Исключение
			ИнформацияОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		Если ИнформацияОбОшибке <> Неопределено Тогда
			СтрокаТаблицы.РезультатСопоставленияСтроки = "Пропущен";
			СтрокаТаблицы.ОписаниеОшибки =
				НСтр("ru = 'Не удалось заблокировать объект.
					|Возможно он открыт в другом окне.
					|
					|Техническая информация:'")
				+ Символы.ПС
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			Возврат;
		КонецЕсли;
		ЭлементСправочника = СтрокаТаблицы.ОбъектСопоставления.ПолучитьОбъект();
		Если ЭлементСправочника = Неопределено Тогда
			СтрокаТаблицы.РезультатСопоставленияСтроки = "Пропущен";
			СтрокаТаблицы.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Объект ""%1"" не существует.'"),
				СтрокаТаблицы.Наименование);
			Возврат;
		КонецЕсли;
		СтрокаТаблицы.РезультатСопоставленияСтроки = "Обновлен";
	КонецЕсли;
	
	ЭлементСправочника.Наименование = СтрокаТаблицы.Наименование;
	ЭлементСправочника.НаименованиеПолное = СтрокаТаблицы.Наименование;
	ЭлементСправочника.ВидКонтрагента = Перечисления._ДемоЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ЭлементСправочника.ИНН = СтрокаТаблицы.ИНН;
	ЭлементСправочника.КПП = СтрокаТаблицы.КПП;
	
	КонтактнаяИнформация = ЭлементСправочника.КонтактнаяИнформация.Добавить();
	КонтактнаяИнформация.АдресЭП = СтрокаТаблицы.Почта;
	КонтактнаяИнформация.Представление = СтрокаТаблицы.Почта;
	КонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтрагента;
	КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	
	КонтактнаяИнформация = ЭлементСправочника.КонтактнаяИнформация.Добавить();
	КонтактнаяИнформация.Представление = СтрокаТаблицы.Адрес;
	КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	КонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтрагента;
	
	Если Не ЭлементСправочника.ПроверитьЗаполнение() Тогда
		СтрокаТаблицы.РезультатСопоставленияСтроки = "Пропущен";
		СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
		Если СообщенияПользователю.Количество() > 0 Тогда
			ОписаниеОшибки = "";
			Для Каждого СообщениеПользователю Из СообщенияПользователю Цикл
				ОписаниеОшибки = ОписаниеОшибки + СообщениеПользователю.Текст + Символы.ПС + Символы.ПС;
			КонецЦикла;
			СтрокаТаблицы.ОписаниеОшибки = СокрП(ОписаниеОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементСправочника.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
